{
  "Pepper_bell_Bacterial_spot": "Bacterial spot in bell pepper is a serious disease that spreads rapidly under warm and wet conditions. Remove and destroy all infected leaves and fruits to prevent spread. Apply copper-based bactericides as an effective control measure, but avoid overuse to prevent resistance. Practice crop rotation and avoid overhead irrigation. Use certified disease-free seeds for future planting.",
  
  "Pepper_bell_healthy": "Your bell pepper plant is currently healthy and thriving. No chemical treatment is required. To maintain its good condition, ensure consistent watering without waterlogging, provide adequate sunlight, and keep the soil well-drained and nutrient-rich. Regularly inspect leaves for early signs of disease or pests and prune lower leaves for better airflow to minimize future risks.",
  
  "Potato_Early_blight": "Potato early blight is caused by the fungus Alternaria solani and typically appears as concentric dark spots on older leaves. Remove all affected leaves and avoid leaving plant debris in the soil. Apply recommended fungicides such as chlorothalonil or mancozeb at early stages. Ensure proper plant spacing for airflow and avoid overhead watering to limit fungal growth.",
  
  "Potato_Late_blight": "Late blight is a devastating disease in potatoes, caused by Phytophthora infestans, and spreads rapidly in cool, moist weather. It causes water-soaked lesions on leaves and dark rot on tubers. Destroy all infected plants immediately to stop spread. Use resistant potato varieties where possible. Apply protective fungicides regularly and ensure good field drainage to minimize disease pressure.",
  
  "Potato_healthy": "Your potato plants are healthy and require no immediate action. To maintain plant vigor, continue proper irrigation practices, avoiding waterlogging. Regularly monitor the leaves for early signs of fungal or viral infections. Apply preventive fungicide sprays during humid conditions if your area is prone to outbreaks. Maintain crop rotation and proper spacing to reduce the risk of soil-borne pathogens.",
  
  "Tomato_Bacterial_spot": "Bacterial spot is a common tomato disease caused by Xanthomonas bacteria. It results in dark, water-soaked lesions on leaves and fruits, reducing yield and quality. Infected plants should be removed immediately. Apply copper-based bactericides for management, but rotate chemicals to prevent resistance. Avoid handling or pruning wet plants. Always use certified seeds and maintain proper field hygiene to minimize recurrence.",
  
  "Tomato_Early_blight": "Early blight in tomatoes is caused by Alternaria solani and usually appears as concentric ring spots on lower leaves. Remove infected foliage and discard away from the field. Apply fungicides like mancozeb or chlorothalonil early for effective control. Avoid excessive nitrogen fertilization, ensure adequate potassium, and irrigate at the soil level to keep leaves dry and reduce fungal spread.",
  
  "Tomato_Late_blight": "Tomato late blight, caused by Phytophthora infestans, is highly destructive and can ruin entire crops within days. It appears as large, irregular water-soaked patches on leaves with white fungal growth underneath. Infected plants should be destroyed immediately to prevent spreading. Apply protective fungicides regularly during humid conditions. Ensure proper air circulation and plant spacing, and avoid excessive leaf wetness.",
  
  "Tomato_Leaf_Mold": "Leaf mold is caused by the fungus Passalora fulva and thrives in humid environments. It manifests as pale spots on upper leaf surfaces and velvety mold underneath. Reduce greenhouse or field humidity through proper ventilation and spacing. Apply sulfur-based or copper fungicides as needed. Prune overcrowded plants and avoid prolonged leaf wetness. Always sanitize tools before and after pruning.",
  
  "Tomato_Septoria_leaf_spot": "Septoria leaf spot is caused by Septoria lycopersici and is one of the most damaging tomato leaf diseases. It appears as numerous small, circular spots with dark brown margins and gray centers. Remove and destroy infected leaves immediately. Apply fungicides like chlorothalonil or mancozeb. Rotate crops with non-solanaceous plants and keep foliage dry by using drip irrigation methods.",
  
  "Tomato_Spider_mites_Two_spotted_spider_mite": "Spider mites are tiny pests that cause yellowing, stippling, and leaf drop in tomatoes, thriving in hot and dry conditions. Inspect the undersides of leaves for webbing and colonies. Use insecticidal soap or neem oil sprays for control. Maintain adequate soil moisture and encourage natural predators like ladybugs. Avoid dusty conditions around plants and control nearby weeds that host mites.",
  
  "Tomato_Target_Spot": "Target spot is a fungal disease caused by Corynespora cassiicola, presenting as brown, concentric lesions on leaves that resemble a target. It weakens plants and reduces fruit quality. To manage, use only disease-free seeds and resistant cultivars if available. Apply preventive fungicides like mancozeb. Rotate crops with non-host plants and remove infected debris to reduce overwintering fungal spores.",
  
  "Tomato_Tomato_YellowLeaf__Curl_Virus": "Tomato Yellow Leaf Curl Virus (TYLCV) is a devastating viral disease transmitted by whiteflies. Symptoms include yellowing, upward curling leaves, and stunted growth. Management includes immediate removal of infected plants and controlling whitefly populations using yellow sticky traps, insecticidal sprays, or reflective mulches. Plant resistant tomato varieties where possible. Avoid planting near already infected crops to reduce spread.",
  
  "Tomato_Tomato_mosaic_virus": "Tomato Mosaic Virus (ToMV) spreads through contaminated tools, hands, and even smoking near plants. It causes mottling, leaf distortion, and reduced fruit yield. Remove and destroy all infected plants. Disinfect tools and hands regularly with bleach solution. Avoid tobacco use near crops. Use resistant varieties and maintain strict sanitation practices in greenhouses and open fields to minimize spread.",
  
  "Tomato_healthy": "Your tomato plant is in excellent health with no visible signs of disease or pest damage. No treatment is required. To keep it healthy, water consistently at the base of the plant, prune overcrowded foliage to increase airflow, and provide balanced fertilization. Monitor regularly for early disease symptoms so that preventive action can be taken before problems escalate."
}
